/*
 * ============================================================
 * Birthday Quiz 設定ファイル
 * ============================================================
 *
 * 基本的には、このファイルだけ編集すれば
 * ゲーム内容を変更できます。
 *
 *
 * type:
 *
 *   "yesno"
 *      → 「はい」「いいえ」ボタンで回答
 *
 *   "text"
 *      → テキスト入力で回答
 *
 *
 * text問題の answers は複数指定できます。
 *
 * 例:
 *
 *   answers: ["桃", "もも", "モモ"]
 *
 *
 * 以下のような違いは自動的に吸収します。
 *
 *   桃
 *    桃
 *   もも
 *   モモ
 *
 * ※文字そのものが違う場合は別回答です。
 *
 * ============================================================
 */


/* ============================================================
   ゲーム全体の設定
============================================================ */

const GAME_CONFIG = {

  /*
   * ゲームタイトル
   */
  title: "しおの ときお, 田中 亨...(3)",


  /*
   * 質問者のデフォルト名
   */
  //friendName: "しおの ときお",
  /*
   * 質問者のデフォルトアイコン
   *
   * 後から画像ファイルを差し替える場合は
   * ここを変更します。
   */
  //friendIcon: "assets/friend-avatar.svg",

  questioners: {

    friend1: {
      name: "しおの ときお",
      icon: "assets/shiono-icon.jpg"
    },

    friend2: {
      name: "田中 亨尚",
      icon: "assets/tanaka-icon.png"
    }

  },

  /*
   * 回答者のデフォルト名
   */
  userName: "飛瀬 瑛貴",
  /*
   * 回答者のデフォルトアイコン
   */
  userIcon: "assets/tobise-icon.jpg",

  /*
   * チャット背景画像
   *
   * 独自画像に変更する場合は、
   *
   * assets/background.jpg
   *
   * のようなファイルを用意して変更します。
   */
  backgroundImage: "assets/chat-bg.svg",


  /*
   * ==========================================================
   * ゲーム開始時のメッセージ
   * ==========================================================
   *
   * 上から順番に表示されます。
   *
   * typingDelay:
   *   「入力中…」を表示する時間
   *   単位はミリ秒です。
   *
   * 1000 = 1秒
   */

  startMessages: [

    {
      sender: "friend1",
      text:
        "おっ！",

      typingDelay: 700
    },
    {
      sender: "friend1",
      text:
        "グループ入ってくれたか、さんきゅー！",

      typingDelay: 700
    },

    {
      sender: "friend1",
      text:
        "...ん？これ、本当に飛瀬のアカウントか？",

      typingDelay: 2500
    },
    {
      sender: "friend2",
      text:
        "確かに違う気もする",

      typingDelay: 2500
    },
    {
      sender: "friend2",
      text:
        "いくつか質問して本人か確かめてみる？",

      typingDelay: 700
    },
    {
      sender: "friend1",
      text:
        "名案～",

      typingDelay: 2500
    },

  ],

  endMessages: [
    {
      sender: "friend1",
      text:
        "全問正解じゃん！",

      typingDelay: 700
    },
    {
      sender: "friend2",
      text:
        "これは飛瀬くんだね。",

      typingDelay: 700
    },
    {
      sender: "friend1",
      text:
        "…てかさ、",

      typingDelay: 700
    },
  ],


  /*
   * ==========================================================
   * 全問正解後のプレゼント設定
   * ==========================================================
   */

  reward: {

    /*
     * プレゼント画面のタイトル
     */
    title:
      "Correct！",


    /*
     * プレゼント画面に表示するメッセージ
     */
    message:
      "全問正解おめでとう！\n本人とわかったのでこれをあげましょう！",


    /*
     * プレゼント表示ボタン
     */
    buttonText:
      "開く",


    /*
     * ========================================================
     * iTunes / Apple Gift Cardコード
     *
     * ここに実際のコードを入力してください。
     *
     * ========================================================
     */

    code:
      "XM247MYFD84V9V2P",


    /*
     * コード表示後のメッセージ
     */
    afterMessage:
      "誕生日おめでとう！稲城の二人より"

  }

};


/* ============================================================
   問題設定
============================================================ */

/*
 * この配列に問題を追加・削除します。
 *
 * 現在は5問用意しています。
 *
 * 問題数は5問に固定されていません。
 *
 * 例えば6問目を追加したければ、
 * 下に同じ形式の問題を追加できます。
 */

const questions = [


  /* ==========================================================
     第1問
  ========================================================== */

  {

    /*
     * 問題形式
     *
     * yesno:
     *   はい / いいえ
     *
     * text:
     *   テキスト入力
     */
    type: "yesno",


    /*
     * 問題文
     */
    question:
      "飛瀬くんは大丈夫そう？",


    /*
     * 正解
     *
     * "yes" → はい
     * "no"  → いいえ
     */
    answer:
      "yes",


  /*
   * 問題を出す人
   *
   * friend1 → しおの ときお
   * friend2 → 田中 亨尚
   */
  questioner:
    "friend2",


    /*
     * 正解した場合のメッセージ
     */
    correctMessage:
      "よっしゃ、じゃあ問題出すか～",


    /*
     * 正解メッセージを送る人
     */
    correctQuestioner:
      "friend1",

    /*
     * 間違えた場合のメッセージ
     */
    incorrectMessage:
      "そんな時間はかからないと思うよ。",


  /*
   * 不正解メッセージを送る人
   */
  incorrectQuestioner:
    "friend2"


  },


  /* ==========================================================
     第2問
  ========================================================== */

  {

    type: "text",


    question:
      "僕が26年度の日帰り組合旅行に行かなかったのは、〇〇に行っていたから。〇〇に入るのは？",

    answers: [
      "コミティア",
      "こみてぃあ",
    ],


     questioner:
        "friend2",


    correctMessage:
      "正解！あれに行かない選択肢はなかった。",


    correctQuestioner:
      "friend2",

    incorrectMessage:
      "惜しい！そこには行ってないよ。",


    incorrectQuestioner:
      "friend2",


  },


  /* ==========================================================
     第3問
  ========================================================== */

  {

    type: "text",


    question:
      "問題！\n塩野が銭湯で読んでドはまりした挙句、影響されまくり、\nボーナスをつぎ込むことになった漫画のタイトルは？",

    answers: [
      "ゆるきゃん",
      "ゆるキャン△",
      "ゆるキャン",
      "ユルキャン"
    ],

    questioner:
      "friend1",

    correctMessage:
      "正解！ついにSWには大学の友達とキャンプ行くことになりました。",


    correctQuestioner:
      "friend1",

    incorrectMessage:
      "それにはボーナス使ってないね～",


    incorrectQuestioner:
      "friend1",

  },


  /* ==========================================================
     第4問
  ========================================================== */

  {

    type: "text",


    question:
      "問題！僕たちが行ったダイニングキッチン エルツはもともとは何屋さんだった？",


    answers: [
      "そば",
      "蕎麦",
      "おそば",
      "お蕎麦",
      "蕎麦屋",
      "そば屋",
      "そばや",
      "蕎麦や",
    ],


    questioner:
      "friend2",

    correctMessage:
      "正解！店舗の形にも名残があったよね",


    correctQuestioner:
      "friend2",

    incorrectMessage:
      "いや、違うけど…",


    incorrectQuestioner:
      "friend2",
  },


  /* ==========================================================
     第5問
  ========================================================== */

  {

    type: "text",


    question:
      "最後の問題！！\n塩野は『超かぐや姫！』の主人公のことをなんと呼んでいる？",


    answers:
      ["さかよりさん",
      "酒寄さん",
    ],


    questioner:
      "friend1",

    correctMessage:
      "正解！\n創作物のキャラクターは苗字+さん付けがマイブーム…",

    correctQuestioner:
      "friend1",


    incorrectMessage:
      "残念！\n想像だけど、物語後半以降の彼女は口内炎直っていたでしょうね。",


    incorrectQuestioner:
      "friend1",
  }

];

